Revit 2024 API
StructuralConnectionHandlerType.ConnectionGuid Property
 The GUID to use for identifying connection geometry generation algorithm.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public Guid ConnectionGuid { get; }
Visual Basic
Public ReadOnly Property ConnectionGuid As Guid
	Get
Visual C++
public:
property Guid ConnectionGuid {
	Guid get ();
}
See Also
StructuralConnectionHandlerType Class
Autodesk.Revit.DB.Structure Namespace